


//1.有一个数组，内放10个学生的英语成绩，写一个函数，求出平均分，并且打印出高于平均分的英语成绩。

//2.编写一个函数计算任一输入的整数的各位数字之和。主函数包括输入输出和调用该函数。

//3.已有函数调用语句c=add(a,b)；请编写add函数，计算两个实数a和b的和，并返回和值。
//double add(double x,double y){}

//4.已有变量定义语句double a=5.0;int n=5;和函数调用语句mypow(a,n);用以求a的n次方。请编写double mypow(double x,int y)函数
//double mypow(double x,double y){}

//5.已有变量定义和函数调用语句 int a,b;b=sum(a);函数sum()用以求 1+2+……+k，和数作为函数值返回。若a的值为10.经函数sum的计算
//后，b的值是55.请编写sum函数。
//sum(int n){}

//6.已有变量定义和函数调用语句：int a=1,b=-5,c=fun(a,b);fun函数的作用是计算两个数之差的绝对值，并将差值返回调用
//函数，请编写fun函数。
//fun(int x,int y){}

//7.已有变量定义和函数调用语句：int x=57;isprime(x);函数isprime()用来判断一个整型数a是否为素数，若是素数，函数返回1，否则返回0
//请编写isprime函数。
//isprime(int a){}

//8.利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。

//9.函数递归调用计算阶乘

//10.输入10个学生的成绩，分别用函数实现：
//(1)求平均成绩；
//(2)按分数高低进行排序输出。

//11.若有一4*4二维矩阵，试编程完成如下功能：
//(1)求4*4列数组的对角线元素之和；
//(2)将二维数组元素行列互换后存入另一数组，并将此数组输出。

//12.有两个字符串，各有10个字符，试编程完成如下功能：
//(1)分别找出两个字符串中最大的字符元素；
//(2)将两字符串对应位置元素逐个比较，并统计输出两个字符串对应元素大于，小于和等于的次数。(所有功能都用函数调用实现)