


//1.用起泡法对10个数排序。

//2.编一程序，从键盘输入10个整数并保存到数组，求出该10个整数的最大值，最小值及平均值。

//3.将一个n*m二维数组的行和列元素互换，存到另一个m*n的二维数组中，并输出其结果。
//例如：static int a[2][3]={{1,2,3},{4,5,6}};

//4.编一程序，从键盘输入10个整数保存到数组，要求找出最小的数和它的下标，然后把它和数组中最前面的元素对换位置。

//5.编写程序，从键盘输入n个由小到大的顺序排好的数列和一个数insert_value,把insert_value插入到由这n个数组成的数列中，
//而且仍然保持有小到大的顺序，若insert_value比原有所有的数都大时放在最后，比原有的数都小时放在最前面。

//6.编程完成下述功能：从键盘输入一个n*n(最大为20*20)矩阵的各元素的值，求出该矩阵两条对角线上各元素值之和并打印出结果

//7.求Fibonacci数列中的前20个数，Fibonacci数列的前两个数为1，1，以后每一个数都是前两个数之和。Fibonacci数列的前
//n个数为1，1，2，3，5，8，13，用数组存放数列前20个数，并输出之（按一行五个输出）。

//8.有一个5*5二维数组，试编程求周边元素及对角线元素之和，并输出该数组值最小的元素。

//9.试编一程序完成以下功能：定义一个含有30个整型元素的数组，按顺序分别赋予从2开始的偶数；然后按顺序每5个数求出一个
//平均值，放在另一数组中并输出。